{
  "dialog1": {
    "start": {
      "bot": "What do you think, does every person have their own purpose in life?",
      "options": [
        {
          "text": "Yes, I'm sure that everyone has a unique goal or path that they're destined for.",
          "next": "step1"
        },
        {
          "text": "I don't think so. Many people just live as they can, without a clear purpose or mission.",
          "next": "step1"
        }
      ]
    },
    "step1": {
      "bot": "Interesting... But if we assume there's no purpose, doesn't that justify passivity and inaction? And if there is a purpose, why are so many people dissatisfied with their lives? Could it be that the idea of a grand purpose is just an illusion?",
      "options": [
        {
          "text": "Yeah, it's strange. It seems like all this talk about 'purpose' often serves as an excuse not to admit that life might just be chaotic.",
          "next": "step2"
        },
        {
          "text": "No, I think the sense of purpose is a real feeling that motivates people. Without it, we'd fall into complete indifference.",
          "next": "step2"
        }
      ]
    },
    "step2": {
      "bot": "If life has no pre-written script, does that mean we're completely free to create our own story? Or are we still limited by genetics, environment, culture, and other factors?",
      "options": [
        {
          "text": "Maybe we are 'prisoners' of circumstances...",
          "next": "step3"
        },
        {
          "text": "I tend to believe that we can create meaning ourselves...",
          "next": "step3"
        }
      ]
    },
    "step3": {
      "bot": "But if we invent meaning and purpose ourselves, doesn't that devalue the whole concept? Doesn't it need to come from above, or be given by nature/God/the universe?",
      "options": [
        {
          "text": "Maybe it really is just a story we tell ourselves... but good stories motivate.",
          "next": "final"
        },
        {
          "text": "No, I believe there's something greater than just a human invention...",
          "next": "final"
        }
      ]
    },
    "final": {
      "bot": "It seems like the question of purpose always leaves room for doubt and faith. Perhaps the very attempt to find or create meaning is our shared purpose.",
      "options": [
        {
          "text": "You're probably right. Maybe the search for meaning is the hidden driver.",
          "next": "end"
        },
        {
          "text": "I still lean toward the idea that purpose exists independently of our perception.",
          "next": "end"
        }
      ]
    },
    "end": {
      "bot": "Thanks for the conversation. No final answers, just a little more clarity. Want to restart?",
      "options": [
        {
          "text": "Yes, start again",
          "next": "start"
        },
        {
          "text": "No, exit",
          "next": "exit"
        }
      ]
    }
  },
  "dialog2": {
    "start": {
      "bot": "Tell me honestly: if the soul perishes with the body, by what standard can we judge its condition? Or perhaps the very act of caring for it proves its eternity?",
      "options": [
        {
          "text": "If the soul is mortal, caring for it is pointless.",
          "next": "step1"
        },
        {
          "text": "Caring for the soul is proof of its immortality.",
          "next": "step1"
        }
      ]
    },
    "step1": {
      "bot": "Interesting… Now tell me: which activities or reflections strengthen the soul, making it ‘healthy’ and steadfast in the face of death?",
      "options": [
        {
          "text": "Doing good deeds and practicing justice.",
          "next": "step2"
        },
        {
          "text": "Seeking truth and contemplating beauty.",
          "next": "step2"
        }
      ]
    },
    "step2": {
      "bot": "You speak of virtues. But what does the soul’s immortality mean: the preservation of your name and deeds in people’s memory, or something deeper, independent of the body?",
      "options": [
        {
          "text": "The remembrance of our actions.",
          "next": "step3"
        },
        {
          "text": "A spiritual essence free from the body.",
          "next": "step3"
        }
      ]
    },
    "step3": {
      "bot": "Socrates said, ‘It is easier to destroy the body, but only the soul fed by truth is immortal.’ Which actions in life, do you think, feed the soul with truth?",
      "options": [
        {
          "text": "Engaging in dialogue and striving for clarity of thought.",
          "next": "step4"
        },
        {
          "text": "Performing selfless acts and caring for others.",
          "next": "step4"
        }
      ]
    },
    "step4": {
      "bot": "Finally, imagine you meet your soul after death. What questions will you ask it: about the mistakes you made, your selflessness, or what you failed to accomplish?",
      "options": [
        {
          "text": "I will ask about the honesty and sincerity of my actions.",
          "next": "final"
        },
        {
          "text": "I will learn how much good I brought into the world.",
          "next": "final"
        }
      ]
    },
    "final": {
      "bot": "This dialogue ends here. Would you like to restart or choose another?",
      "options": [
        {
          "text": "Restart this dialogue",
          "next": "start"
        },
        {
          "text": "Go to main menu / exit",
          "next": "exit"
        }
      ]
    },
    "end": {
      "bot": "Thanks for the conversation!",
      "options": []
    }
  },
  "dialog3": {
    "start": {
      "bot": "Sartre claimed, ‘First we exist, then we define our essence.’ In response to the void of being, which would you choose first—conscious freedom or the sense of anxiety from having no predetermined path?",
      "options": [
        {
          "text": "Freedom—I find meaning there.",
          "next": "step1"
        },
        {
          "text": "Anxiety—without it I wouldn’t grasp the weight of responsibility.",
          "next": "step1"
        }
      ]
    },
    "step1": {
      "bot": "If freedom is boundless, do you feel crushed by the weight of every choice, as if each one forever stamps your essence?",
      "options": [
        {
          "text": "Yes—the weight of choice awakens my vigilance and seriousness.",
          "next": "step2"
        },
        {
          "text": "No—I accept responsibility as the inevitability of my existence.",
          "next": "step2"
        }
      ]
    },
    "step2": {
      "bot": "Sartre described ‘nothingness’ as a space of possibilities. Do you see in it primarily a chance to redefine yourself or an abyss ready to consume you?",
      "options": [
        {
          "text": "A chance—only there is authenticity born.",
          "next": "step3"
        },
        {
          "text": "An abyss—uncertainty frightens me more than any limits.",
          "next": "step3"
        }
      ]
    },
    "step3": {
      "bot": "We tend to hide in ‘bad faith,’ donning others’ masks. Have you ever felt the urge to excuse your own mistakes by saying ‘that’s just how things are’?",
      "options": [
        {
          "text": "Yes—easier to shelter under habit than to admit my freedom.",
          "next": "step4"
        },
        {
          "text": "No—I strive to be honest with myself, even when it’s hard.",
          "next": "step4"
        }
      ]
    },
    "step4": {
      "bot": "Ultimately: if your life could be summed up by a single decision, which move would best express your essence—a bold leap into the unknown or a deliberate act for the sake of others?",
      "options": [
        {
          "text": "A leap into the unknown—I exist for freedom.",
          "next": "final"
        },
        {
          "text": "An act for others—my freedom is to bear responsibility.",
          "next": "final"
        }
      ]
    },
    "final": {
      "bot": "That’s the end of this line of thought. Restart or exit?",
      "options": [
        {
          "text": "Restart",
          "next": "start"
        },
        {
          "text": "Exit",
          "next": "exit"
        }
      ]
    },
    "end": {
      "bot": "Goodbye!",
      "options": []
    }
  }
}
